src/ExternalDataProcessors/ВнешняяОбработкаТЗ_effectmobile_ru/ВнешняяОбработкаТЗ_effectmobile_ru.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ExternalDataProcessor>
  <name>ВнешняяОбработкаТЗ_effectmobile_ru</name>
  <attributes>
    <name>ДатаОтправки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УсловиеИсключения</name>
    <comment>служебный реквизит</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОператорСравнения</name>
    <comment>Укажите &quot;Равно&quot; или &quot;Не равно&quot;</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ХарактеристикаДатыСравнения</name>
    <comment>Сравниваем с &quot;Min&quot; или &quot;Max&quot; датой?</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТаблицаНужныеВедомости</name>
    <attributes>
      <name>Ведомость</name>
      <type>
        <types>DocumentRef.Ведомость</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаВедомости</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусВедомости</name>
      <type>
        <types>EnumRef.СтатусыДокументов</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерВедомости</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоДоговоров</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:ExternalDataProcessor>

src/ExternalDataProcessors/ВнешняяОбработкаТЗ_effectmobile_ru/Forms/Форма/Module.bsl
#Область ОписаниеОбработки
// 
// Вид обработки: Проверка знаний кандидата
// Версия обработки: 1.1.1.2
// Дата создания: 17.04.2026
// Создал: Кулебакин Н.А.
// Описание: Обработка предназначена для проверки знаний кандидата по заданным параметрам
//		и выдачи результата в виде таблицы "Нужные ведомости".
//		Параметры для проверки: Дата проверки, Оператор сравнения, Характеристика даты договора, Ведомость.
//		Реализованы алгоритмы проверки по дополнительным (динамическим) условиям:
//		1. Условия исключения лишнего реализованы в коде автоматически
//		2. Кандидатам мужчинам реализовать условное оформление через программный код (окрас строки
//			 в светло-зеленый цвет), для женщин через конфигуратор - не реализован, 
//			 т.к. он мешает реализации через программный код. 
//		3. Вывода информационного сообщения об удаленных ведомостях реализовано из критерия, что 
//			количество символов в фамилии кандидата 8-9 шт.- через произвольную форму. 
	
#КонецОбласти

#Область ОбработчикиСобытийФормы
&НаКлиенте
Процедура ПриОткрытии(Отказ)// необходимо указать дату отправки тестового задания

	Объект.ДатаОтправки = '20260417'; //дата отправки тестового задания	
	ТаблицаНужныеВедомости = Объект.ТаблицаНужныеВедомости;
	ТаблицаНужныеВедомости.Очистить();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТаблицаНужныеВедомости

&НаКлиенте
Процедура ТаблицаНужныеВедомостиПриАктивизацииЯчейки(Элемент)//отключаем выдление строки
	
	Элемент.ВыделенныеСтроки.Очистить();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ЗаполнитьНужное(Команда)//проверяем исходные данные и вызываем "ЗаполнитьНужноеНаСервере"
	
	Ошибки = "";

	Если Не ЗначениеЗаполнено(Объект.ОператорСравнения) Тогда
		Ошибки = Ошибки + "• Не выбрано условие сравнения (Равно/Не равно)" + Символы.ПС;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Объект.ХарактеристикаДатыСравнения) Тогда
		Ошибки = Ошибки + "• Не выбран параметр даты сравнения (Min/Max)" + Символы.ПС;
	КонецЕсли;

	Если Не ПустаяСтрока(Ошибки) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не выбраны нужные параметры:" + Символы.ПС + Ошибки;
		Сообщение.Сообщить();
	Иначе
		ЗаполнитьНужноеНаСервере(Объект.ДатаОтправки, Объект.ОператорСравнения, Объект.ХарактеристикаДатыСравнения);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура УдалитьЛишнее(Команда)
		
	УдаленныеНомера = УдалитьЛишнееНаСервере();
	ВывестиИнформациюОбУдаленииНаКлиенте(УдаленныеНомера);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВывестиИнформациюОбУдаленииНаКлиенте(УдаленныеНомера)//выводим информацию об удаленных строках на форму

	УдаленныеНомера.СортироватьПоЗначению(НаправлениеСортировки.Возр);

	Количество = УдаленныеНомера.Количество();

	МассивНомеров = Новый Массив;
	Для Каждого ЭлементСписка Из УдаленныеНомера Цикл
		МассивНомеров.Добавить(ЭлементСписка.Значение);
	КонецЦикла;

	ТекстСообщения = "Удалено документов:" + Количество + " (" + СтрСоединить(МассивНомеров, ", ") + ")";

//По условиям задания выводим с помощью произвольной формы.	
	ПараметрыФормы = Новый Структура("Заголовок, Сообщение", "Информация об удалении", ТекстСообщения);
	ОткрытьФорму("Обработка.ПроверкаЗнанийКандидата.Форма.ИнформацияДляПользователя", ПараметрыФормы, , Истина);

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНужноеНаСервере(ДатаОтправки, ОператорСравнения, ХарактеристикаДатыСравнения) //заполняем таблицу
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	МАКСИМУМ(ИсторияСтатусовДокументов.ДатаЗаписи) КАК ДатаЗаписи,
	|	ИсторияСтатусовДокументов.Документ
	|ПОМЕСТИТЬ МаксДатаСтатусаДокумента
	|ИЗ
	|	РегистрСведений.ИсторияСтатусовДокументов КАК ИсторияСтатусовДокументов
	|СГРУППИРОВАТЬ ПО
	|	ИсторияСтатусовДокументов.Документ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИсторияСтатусовДокументов.Документ КАК Документ,
	|	ИсторияСтатусовДокументов.Статус КАК АктуальныйСтатусДокумента
	|ПОМЕСТИТЬ АктуальныеСтатусыДокументовВТ
	|ИЗ
	|	МаксДатаСтатусаДокумента КАК МаксДатаСтатусаДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияСтатусовДокументов КАК ИсторияСтатусовДокументов
	|		ПО МаксДатаСтатусаДокумента.Документ = ИсторияСтатусовДокументов.Документ
	|		И МаксДатаСтатусаДокумента.ДатаЗаписи = ИсторияСтатусовДокументов.ДатаЗаписи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Ведомость.Ссылка КАК Ведомость,
	|	Ведомость.Номер КАК НомерВедомости,
	|	Ведомость.Дата КАК ДатаВедомости,
	|	АктуальныеСтатусыДокументовВТ.АктуальныйСтатусДокумента КАК СтатусВедомости,
	|	Ведомость.Договоры.(
	|		НомерСтроки КАК НомерСтрокиТЧВедомости,
	|		Договор.Наименование КАК НаименованиеДоговора,
	|		Договор.НачалоДействия КАК НачалоДействияДоговора,
	|		Договор.Активен КАК ДоговорАктивен) КАК Договоры
	|ИЗ
	|	Документ.Ведомость КАК Ведомость
	|		ЛЕВОЕ СОЕДИНЕНИЕ АктуальныеСтатусыДокументовВТ КАК АктуальныеСтатусыДокументовВТ
	|		ПО АктуальныеСтатусыДокументовВТ.Документ = Ведомость.Ссылка
	|ГДЕ
	|	НЕ Ведомость.ПометкаУдаления";

	РезультатЗапроса 	= Запрос.Выполнить();
	ВыборкаДокументов 	= РезультатЗапроса.Выбрать();

	Объект.ТаблицаНужныеВедомости.Очистить();

//Помещаем данные из запроса в табличную часть формы и вызываем проверку условий по датам.
	Пока ВыборкаДокументов.Следующий() Цикл
		
		РезультатПроверки = ПроверитьДоговорыВДокументе(ВыборкаДокументов, ОператорСравнения,
			ХарактеристикаДатыСравнения, ДатаОтправки);

		Если РезультатПроверки[0] Тогда
			НоваяСтрока 					= Объект.ТаблицаНужныеВедомости.Добавить();
			НоваяСтрока.Ведомость 			= ВыборкаДокументов.Ведомость;
			НоваяСтрока.НомерВедомости 		= ВыборкаДокументов.НомерВедомости;
			НоваяСтрока.ДатаВедомости 		= ВыборкаДокументов.ДатаВедомости;
			НоваяСтрока.СтатусВедомости 	= ВыборкаДокументов.СтатусВедомости;
			НоваяСтрока.КоличествоДоговоров = РезультатПроверки[1]; // по индексу
		КонецЕсли;

	КонецЦикла;
//Сортируем результат.	
	Объект.ТаблицаНужныеВедомости.Сортировать("ДатаВедомости Возр");

//Выделяем строки в итоговой таблице по условию. 	
	Элементы.ТаблицаНужныеВедомости.Видимость = Истина;
	УстановитьЦветСтрокиТаблицы();
			
КонецПроцедуры

&НаСервере
Функция ПроверитьДоговорыВДокументе(ВыборкаДокументов, ОператорСравнения, ХарактеристикаДатыСравнения, ДатаОтправки)
//Проверяем наличие активных договоров в документе и проверяет условие по датам.	
	ПервыйАктивныйДоговор 	= Неопределено;
	МинимальнаяДата 		= Неопределено;
	МаксимальнаяДата 		= Неопределено;
	ДатаВедомости 			= ВыборкаДокументов.ДатаВедомости;
	КоличествоДоговоров		= 0;
	
	ВыборкаДоговоров = ВыборкаДокументов.Договоры.Выбрать();
	Пока ВыборкаДоговоров.Следующий() Цикл
		КоличествоДоговоров = КоличествоДоговоров + 1;
		
		Если ВыборкаДоговоров.ДоговорАктивен И ПервыйАктивныйДоговор = Неопределено Тогда
			ПервыйАктивныйДоговор = ВыборкаДоговоров.НачалоДействияДоговора;
		КонецЕсли;
		
		Если МинимальнаяДата = Неопределено Или ВыборкаДоговоров.НачалоДействияДоговора < МинимальнаяДата Тогда
			МинимальнаяДата = ВыборкаДоговоров.НачалоДействияДоговора;
		КонецЕсли;
		
		Если МаксимальнаяДата = Неопределено Или ВыборкаДоговоров.НачалоДействияДоговора > МаксимальнаяДата Тогда
			МаксимальнаяДата = ВыборкаДоговоров.НачалоДействияДоговора;
		КонецЕсли;
	КонецЦикла;
	
//Проверяем условие по датам.
	ПроверкаДатыДоговора 	= ПроверитьУсловиеДаты(ПервыйАктивныйДоговор, МинимальнаяДата, МаксимальнаяДата,
											ОператорСравнения, ХарактеристикаДатыСравнения);

//Проверяем дополнительное условие по датам отправки.
	ПроверкаДоп 			= ПроверитьПоДопУсловиям(ДатаОтправки, ДатаВедомости);
	
//Возвращаем результаты проверки
	Если ПроверкаДатыДоговора И ПроверкаДоп Тогда
		РезультатМассива = Новый Массив;
		РезультатМассива.Добавить(Истина);
		РезультатМассива.Добавить(КоличествоДоговоров);
		Возврат РезультатМассива;
	Иначе
		РезультатМассива = Новый Массив;
		РезультатМассива.Добавить(Ложь);
		РезультатМассива.Добавить(КоличествоДоговоров);
		Возврат РезультатМассива;
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ПроверитьУсловиеДаты(ПервыйАктивныйДоговор, МинимальнаяДата, МаксимальнаяДата, ОператорСравнения,
	ХарактеристикаДатыСравнения)
//Проверяем условие по датам договора.
	Если ПервыйАктивныйДоговор 	= Неопределено Или 
			МинимальнаяДата 	= Неопределено Или 
			МаксимальнаяДата 	= Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;

	Если ХарактеристикаДатыСравнения = "Min" Тогда
		НужнаяДата = МинимальнаяДата;
	Иначе
		НужнаяДата = МаксимальнаяДата;
	КонецЕсли;

	Если ОператорСравнения = "Равно" Тогда
		Возврат (ПервыйАктивныйДоговор = НужнаяДата);
	Иначе
		Возврат (ПервыйАктивныйДоговор <> НужнаяДата);
	КонецЕсли;

КонецФункции

&НаСервере
Функция ПроверитьПоДопУсловиям(ДатаОтправки, ДатаВедомости) //По дате отправки тестового задания:
//  1-10 число, тогда не выводим ведомости "Если число (день) даты ведомости равно числу текущей даты"
// 11-20 число, тогда не выводим ведомости "Если число (день) даты ведомости является чётным"
// 21-31 число, тогда не выводим ведомости "Если месяц даты ведомости является нечётным"	
	ДеньОтправки 	= День(ДатаОтправки);
	ДеньВедомости 	= День(ДатаВедомости);
	ДеньТекущий 	= День(ТекущаяДатаСеанса());
	МесяцВедомости 	= Месяц(ДатаВедомости);

	Если ДеньОтправки < 11 И ДеньВедомости = ДеньТекущий Тогда
		Возврат Ложь;
	ИначеЕсли ДеньОтправки > 20 И МесяцВедомости % 2 <> 0 Тогда
		Возврат Ложь;
	ИначеЕсли ДеньОтправки >= 11 И ДеньОтправки <= 20 И ДеньВедомости % 2 = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	Возврат Истина;
	
КонецФункции

&НаСервере
Процедура УстановитьЦветСтрокиТаблицы() //в зависимости от статуса документа
	
	УсловноеОформление.Элементы.Очистить();
			
// Установим цвет строки в зависимости от статуса документа
	НовыйЭлемент = УсловноеОформление.Элементы.Добавить();
	НовыйЭлемент.Использование = Истина;
	
	ЭлементОтбора = НовыйЭлемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ТаблицаНужныеВедомости.СтатусВедомости");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Перечисления.СтатусыДокументов.Акцептован;
	ЭлементОтбора.Использование = Истина;
	
	НовыйЭлемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.СветлоЗеленый);
	
	Поле = НовыйЭлемент.Поля.Элементы.Добавить();
	Поле.Поле = Новый ПолеКомпоновкиДанных("ТаблицаНужныеВедомости");
	Поле.Использование = Истина;

КонецПроцедуры

&НаСервере
Функция УдалитьЛишнееНаСервере() // удаляет лишние ведомости из таблицы "РеквизитТаблицаНужныеВедомости 

	ТаблицаНужныеВедомости 	= РеквизитФормыВЗначение("Объект.ТаблицаНужныеВедомости");
	УдаленныеНомера 		= Новый СписокЗначений;
	
//Перебирает строки и удаляет с четным количеством договоров.
	Индекс = ТаблицаНужныеВедомости.Количество() - 1;
	Пока Индекс >= 0 Цикл
		СтрокаТаблицы = ТаблицаНужныеВедомости[Индекс];
//Проверка четности количества договоров.
		Если СтрокаТаблицы.КоличествоДоговоров % 2 = 0 Тогда
			УдаленныеНомера.Добавить(Строка(СтрокаТаблицы.НомерВедомости));
			ТаблицаНужныеВедомости.Удалить(Индекс);
		КонецЕсли;

		Индекс = Индекс - 1;
	КонецЦикла;
	
//Сортировка по возрастанию номера.
	УдаленныеНомера.СортироватьПоЗначению(НаправлениеСортировки.Возр);

	Возврат УдаленныеНомера;

КонецФункции

#КонецОбласти
